mapping = {
    'ONDC_TEXT_1': ['customer_name']
}

ONDC = {
    'TXT_START': "Welcome to Travel Buddy.\nI'll be glad to help you book a ride.\nPlease tell me your name.",
    'TXT_1': 'Hello {customer_name}!\nWhich language would  you like to use ?\nआप किस भाषा का प्रयोग करना चाहेंगे?',
    'TXT_1_BTNS': ['हिंदी', 'English'],
    'TXT_2': '📍 Lets start with your pickup . Please use Location within Whatsapp to set the start location.',
    'TXT_3': 'Thank you. Where would you like to go ?📍 Please mark the destination location using the location on whatsapp.',
    'TXT_4': 'Finding rides for you ...',
    'TXT_5_BTNS': ['Proceed', 'Cancel Ride'],
    'TXT_6': 'Please wait while we allocate a driver for you...',
    'TXT_7_BTNS': ['Cancel', 'Get Support'],
    'TXT_8': 'Please call +919876543210 to get assistance.',
    'TXT_9': 'Your trip has been *Cancelled*. Thank you for using Ride Services!',
    'TXT_10': 'Helpline notified. We are reaching you immediately !',
    'TXT_END': 'Sorry, unable to process your request.',
    'TXT_FAIL': 'Sorry, we are unable to confirm your ride. Please, try again after sometime.',
    'TXT_LOC_START': 'Sorry! Please, select your location from WhatsApp.',
    'TXT_LOC_END': 'Sorry!Please, select your location from WhatsApp.',
    'TXT_CANCEL': 'We are sorry you have to cancel.',
    'TXT_SEARCH': 'Please click the button to search for rides',
    'TXT_SEARCH_BTNS': ['Search Rides']
}

HI = {
    'TXT_2': '📍 चलिए आपके पिकअप से शुरू करते हैं। प्रारंभ स्थान सेट करने के लिए कृपया व्हाट्सएप के भीतर "स्थान" का उपयोग करें।',
    'TXT_22': '📍 चलिए आपके पिकअप से शुरू करते हैं। प्रारंभ स्थान सेट करने के लिए कृपया व्हाट्सएप के भीतर "स्थान" का उपयोग करें।',
    'TXT_3': 'शुक्रिया। आप कहाँ जाना चाहेंगे ?📍 कृपया व्हाट्सएप पर स्थान का उपयोग करके गंतव्य स्थान को चिह्नित करें।',
    'TXT_4': 'आपके लिए यात्राएं ढूंढी जा रही हैं...',
    'TXT_5_BTNS': ['आगे बढ़ें', 'सवारी रद्द करें'],
    'TXT_6': 'कृपया प्रतीक्षा करें जब तक हम आपके लिए एक ड्राइवर आवंटित करते हैं...',
    'TXT_7_BTNS': ['सवारी रद्द करें'],
    'TXT_8': 'यदि आपकी सवारी के दौरान कोई आपातकालीन स्थिति है, तो यात्रा के दौरान सहायता प्राप्त करने के लिए "सहायता" बटन दबाएं या +919876543210 पर कॉल करें।',
    'TXT_8_BTNS': ['मदद'],
    'TXT_9': 'आपकी यात्रा *रद्द* कर दी गई है। Ride Services उपयोग करने के लिए आपका धन्यवाद !',
    'TXT_10': 'हेल्पलाइन अधिसूचित। हम आप तक तुरंत पहुंच रहे हैं!',
    'TXT_END': 'क्षमा करें, आपका अनुरोध संसाधित करने में असमर्थ। कृपया दिए गए विकल्पों में से चुनें',

    'TXT_FAIL': 'क्षमा करें, हम आपकी राइड की पुष्टि करने में असमर्थ हैं। कृपया, कुछ समय बाद पुन: प्रयास करें।',
    'TXT_LOC_START': 'क्षमा करें! कृपया, व्हाट्सएप से अपना स्थान चुनें।',
    'TXT_LOC_END': 'क्षमा करें! कृपया, व्हाट्सएप से अपना स्थान चुनें।',
    'TXT_WAIT': 'Wait message',
    'TXT_CANCEL': 'हमें खेद है कि आपको रद्द करना पड़ा।',
    'TXT_SEARCH': 'राइड खोजने के लिए कृपया बटन पर क्लिक करें',
    'TXT_SEARCH_BTNS': ['सवारी खोजें']
}

